-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: 2017-09-21 03:04:21
-- 服务器版本： 5.7.19
-- PHP Version: 5.6.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test`
--

DELIMITER $$
--
-- 存储过程
--
DROP PROCEDURE IF EXISTS `test`$$
CREATE DEFINER=`root`@`localhost` PROCEDURE `test` (IN `pageID` BIGINT, OUT `str` VARCHAR(8000))  begin
declare found boolean default true;declare str1 varchar(8000);
declare num cursor for select answer from pagedetail where PID=pageID; declare continue handler for not found set found = false;
set str = '';
open num;fetch num into str1;while found do
set str=concat(str,'|',str1);
fetch num into str1;
end while;
close num;end$$

--
-- 函数
--
DROP FUNCTION IF EXISTS `str_answer`$$
CREATE DEFINER=`root`@`localhost` FUNCTION `str_answer` (`pageID` BIGINT(20)) RETURNS VARCHAR(8000) CHARSET utf8mb4 BEGIN
  CALL test(pageID,@p1); 
  RETURN @p1;
END$$

DELIMITER ;

-- --------------------------------------------------------

--
-- 表的结构 `answer`
--

DROP TABLE IF EXISTS `answer`;
CREATE TABLE IF NOT EXISTS `answer` (
  `ID` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '简答题答案',
  `SID` varchar(20) DEFAULT '1' COMMENT '科目ID',
  `UID` varchar(20) DEFAULT '1' COMMENT '上传教师',
  `source` varchar(50) DEFAULT '三亿文库' COMMENT '试题来源',
  `content` varchar(500) DEFAULT NULL COMMENT '试题内容',
  `answer` varchar(500) DEFAULT NULL COMMENT '试题答案',
  `resolve` varchar(500) DEFAULT '无' COMMENT '试题解析',
  `type` varchar(6) DEFAULT 'answer' COMMENT '试题类别',
  `score` tinyint(4) DEFAULT '5' COMMENT '分值',
  `time` datetime DEFAULT NULL COMMENT '上传时间',
  PRIMARY KEY (`ID`),
  KEY `SID` (`SID`),
  KEY `TID` (`UID`)
) ENGINE=MyISAM AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `answer`
--

INSERT INTO `answer` (`ID`, `SID`, `UID`, `source`, `content`, `answer`, `resolve`, `type`, `score`, `time`) VALUES
(1, '1', '1', '豆瓣 希赛软考学院', ' 人工管理阶段数据管理的特点：', '（1）数据不保存在机器中\r\n（2）无专用的软件对数据进行管理\r\n（3）只有程序的概念，没有文件的概念\r\n（4）数据面向程序', '无', 'answer', 5, '2017-08-09 00:00:00'),
(2, '1', '1', '希赛软考学院', '文件系统阶段数据管理的特点：', '（1）数据可长期保存在外存的磁盘上\r\n（2）数据的逻辑结构和物理结构有了区别\r\n（3）文件组织已呈多样化。有索引、链接和散列文件\r\n（4）数据不再属于某个特定的程序，可重复使用。', '无', 'answer', 5, '2017-08-22 16:54:29'),
(3, '1', '1', '希赛软考学院', 'DBMS的主要功能：', '（1） 数据库的定义功能：DBMS提供数据定义语言（DDL）定义数据库的三级结构及其相互之间的映象、完整性、安全控制等约束。\r\n（2） 数据库的操纵功能：DBMS提供数据操纵语言（DML）实现对数据库中数据的操作。\r\n（3） 数据库的保护功能：DBMS对数据库的保护主要通过数据库的恢复、数据库的并发控制、数据库的完整性控制、数据库的安全性控制等四个方面实现。\r\n（4） 数据库的存储管理：DBMS的存储管理子系统提供了数据库中数据和应用程序的一个界面，其职责是把各种DML语句转换成低层的文件系统命令，起到数据的存储、检索和更新的作用。\r\n（5） 数据库的维护功能：DBMS中实现数据库维护功能的实用程序主要有数据装载程序、备份程序、文件重组织程序、性能监控程序。\r\n（6） 数据字典（DD）：数据库系统中存放三级结构定义的数据库称为数据字典，对数据库的操作都要通过访问DD才能实现。', '无', 'answer', 5, '2017-08-22 16:56:47'),
(4, '1', '1', '三亿文库', '什么是视图，它与表的区别是什么：', '在SQL中，外模式一级数据结构的基本单位是视图，视图是从若干基本表和（或）其他视图构造出来的表。我们创建一个视图时，只是把其视图的定义存放在数据字典中，而不存储视图对应的数据，因此，视图被称为“虚表”，这是它与表的主要区别。', '无', 'answer', 5, '2017-08-22 16:58:14'),
(5, '1', '1', '三亿文库', 'SQL语言有哪两种使用方式：', '一种是扩充宿主语言的编译程序，使之能处理SQL语句；\r\n另一种是采用预处理方式。目前多数系统采用后一种。', '无', 'answer', 5, '2017-08-22 16:58:18'),
(6, '4', '1', '三亿文库', '近代中国社会的两对主要矛盾是什么? \r\n', '帝国主义和中华民族的矛盾，封建主义和人民大众的矛盾 \r\n', '无', 'answer', 5, '2017-08-22 17:58:07'),
(7, '4', '1', '三亿文库', '1840-1919年西方列强发动的对中国的5次大规模军事战争是什么? \r\n', '1840年，英国发动侵略中国的鸦片战争 \r\n1856—1860年，英法联动发动侵略中国的第二次鸦片战争 \r\n1883年，法国发动侵略越南和中国的中法战争 \r\n\r\n1894年，日本发动侵略朝鲜和中国的中日甲午战争 \r\n1900年，八国联军侵华战争 ', '无', 'answer', 5, '2017-08-22 17:58:59'),
(8, '4', '1', '三亿文库', '辛亥革命失败的原因是什么? \r\n', '从根本上说，是因为在帝国主义时代，在半殖民半封建的中国，资本主义的建国方法是根本行不通的。 \r\n从主观方面来说，在于它的领导资产阶级革命派本身存在着许多弱点和错误。主要是：第一、没有提出彻底的反帝反封建的革命纲领。第二、不能充分发动和依靠人民群众。第三、不能建立坚强的革命政党，作为团结一切革命力量的强有力的核心。 \r\n', '无', 'answer', 5, '2017-08-22 17:59:28'),
(9, '4', '1', '三亿文库', '八七会议前后中国共产党领导的三大武装起义是什么？', '南昌起义、秋收起义、广州起义 \r\n', '无', 'answer', 5, '2017-08-22 17:59:47'),
(10, '4', '1', '三亿文库', '列举5位在抗日战争中涌现出来的民族英雄。 \r\n', '吉鸿昌，佟麟阁，赵登禹，赫梦龄，张自忠，左权，孙立人  赵一曼   冯玉祥   杨靖宇   李宗仁 \r\n', '无', 'answer', 5, '2017-08-22 18:00:07'),
(11, '4', '1', '三亿文库', '社会主义改造指的是哪三大改造？ \r\n', '1 农业社会主义改造  2手工业社会主义改造 3资本主义工商业社会主义改造', '无', 'answer', 5, '2017-08-22 18:00:28'),
(12, '4', '1', '三亿文库', '7.1921-1949年中国存在的3种主要的政治力量是什么? \r\n', '地主阶级，民族资产阶级，无产阶级 \r\n', '无', 'answer', 5, '2017-08-22 18:00:53'),
(13, '4', '1', '三亿文库', '新中国成立以来取得哪些历史性成就? \r\n', '第一，从争取经济独立到建设社会主义现代化国家 \r\n\r\n第二，从赢得政治独立到建设社会主义民主政治 \r\n第三，从发展新民主主义文化到建设中国特色社会主义文化 \r\n第四，从打破封锁到全方位对外开放 \r\n\r\n第五，从“小米加步枪”到逐步实现国防现代化 \r\n', '无', 'answer', 5, '2017-08-22 18:01:35'),
(14, '2', '1', '三亿文库', '输入序列为ABC，可以变为CBA时，经过的栈操作为', 'push，push，push，pop， pop， pop', '无', 'answer', 5, '2017-09-21 10:39:19'),
(15, '2', '1', '三亿文库', '队列的“先进先出”特性是指', '每次从队列中删除的总是最早插入的元素', '无', 'answer', 5, '2017-09-21 10:39:19'),
(16, '5', '1', '三亿文库', '为什么需设置总线判优控制。常见的总线控制方式有哪些？', '答：当有多个设备同时请求使用总线时，必须有总线控制器判断，确定优先级别高的设备优先使用总线，否则会引起总线争用而出现数据传输错误。\r\n常见的集中式总线控制方式有：链式、定时计数式以及独立请求方式。\r\n', '无', 'answer', 5, '2017-09-21 10:45:53'),
(17, '5', '1', '三亿文库', '什么是存取周期和存取时间，并加以区别。', '存取周期是指两次相邻的存储器存取操作的时间间隔。存取时间是指对存储器从发出读写指令开始到存取相应的数据的时间。存取周期大于存取时间。', '无', 'answer', 5, '2017-09-21 10:45:53'),
(18, '3', '1', '三亿文库', '恩格斯说：“历史是这样创造的：最终的结果总是从许多单个的意志的相互冲突中产生出来的，而其中每一个意志，又是由于许多特殊的生活条件，才成为它所成为的那样。这样就有无数互相交错的力量，有无数个力的平行四边形，而由此就产生出一个总的结果，即历史事变，这个结果又可以看作一个作为整体的、不自觉的和不自主地起着作用的力量的产物……各个人的意志……虽然达不到自己的愿望，而是整合为一个总的平均数，一个总的合力。” \"\r\n——《马克思恩格斯选集》第 4 卷, 人民出版社 1995 年版,第 697 页\r\n谈谈你对恩格斯这段话的看法？\r\n', '恩格斯的这段话主要反映了他的历史合力论的思想。\r\n2，	首先他强调了个人的意志及其力量对社会发展会产生重大的影响，反对了宿命论；\r\n3，	其次，他认为个人意志与力量对历史影响的发挥是以当时社会经济的前提和条件的制约为前提的，反对了唯心史观。\r\n\r\n', '无', 'answer', 5, '2017-09-21 10:47:30'),
(19, '3', '1', '三亿文库', ' 从实践是人和自然关系的基础的角度说明为什么“垃圾是放错地方的资源”？', '1，	实践是人与自然界分化与统一的基础。人类产生以后，自然界在人的实践活动中以新的形式，延续自己的存在和发展，它是人类生存发展的前提。人们可以运用已经获得的对自然规律的认识指导实践，达到对自然界的改造。这种改造会产生两种结果，一种既顺应了自然界发展规律又满足了人类自身发展需要。另一种是如果人们违背了自然界的规律而发挥主观的能动作用，不保持自身与自然的和谐统一,那就会危及自身的生存发展。', '无', 'answer', 5, '2017-09-21 10:47:30');

--
-- 触发器 `answer`
--
DROP TRIGGER IF EXISTS `Tri_Answer`;
DELIMITER $$
CREATE TRIGGER `Tri_Answer` BEFORE INSERT ON `answer` FOR EACH ROW BEGIN 
set new.time=now();
END
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- 替换视图以便查看 `answer_view`
-- (See below for the actual view)
--
DROP VIEW IF EXISTS `answer_view`;
CREATE TABLE IF NOT EXISTS `answer_view` (
`name` varchar(20)
,`ID` bigint(20)
,`SID` varchar(20)
,`UID` varchar(20)
,`source` varchar(50)
,`content` varchar(500)
,`answer` varchar(500)
,`resolve` varchar(500)
,`type` varchar(6)
,`score` tinyint(4)
,`time` datetime
);

-- --------------------------------------------------------

--
-- 表的结构 `arecorder`
--

DROP TABLE IF EXISTS `arecorder`;
CREATE TABLE IF NOT EXISTS `arecorder` (
  `ID` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '答题号',
  `SID` varchar(20) DEFAULT NULL COMMENT '答题学生号',
  `PID` bigint(200) DEFAULT NULL COMMENT '试卷号',
  `time` datetime DEFAULT NULL COMMENT '答题时间',
  `Scontent` varchar(1000) DEFAULT NULL COMMENT '答题内容',
  `Ascore` float NOT NULL COMMENT '该题得分',
  PRIMARY KEY (`ID`),
  KEY `SID` (`SID`)
) ENGINE=MyISAM AUTO_INCREMENT=60 DEFAULT CHARSET=utf8;

--
-- 触发器 `arecorder`
--
DROP TRIGGER IF EXISTS `Tri_Arecorder`;
DELIMITER $$
CREATE TRIGGER `Tri_Arecorder` BEFORE INSERT ON `arecorder` FOR EACH ROW BEGIN 
set new.time=now();
END
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- 表的结构 `choice`
--

DROP TABLE IF EXISTS `choice`;
CREATE TABLE IF NOT EXISTS `choice` (
  `ID` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '选择题题号',
  `SID` varchar(20) DEFAULT '1' COMMENT '科目号',
  `UID` varchar(20) DEFAULT '1' COMMENT '上传教师',
  `source` varchar(50) DEFAULT '三亿文库' COMMENT '试题来源',
  `content` varchar(500) DEFAULT NULL COMMENT '试题内容',
  `A` varchar(50) DEFAULT NULL,
  `B` varchar(50) DEFAULT NULL,
  `C` varchar(50) DEFAULT NULL,
  `D` varchar(50) DEFAULT NULL,
  `answer` char(1) DEFAULT NULL COMMENT '试题答案',
  `resolve` varchar(500) DEFAULT '无' COMMENT '试题解析',
  `type` char(6) DEFAULT 'choice' COMMENT '试题类型',
  `score` tinyint(4) DEFAULT '1' COMMENT '分值',
  `time` datetime DEFAULT NULL COMMENT '上传时间',
  PRIMARY KEY (`ID`),
  KEY `SID` (`SID`),
  KEY `TID` (`UID`)
) ENGINE=MyISAM AUTO_INCREMENT=22 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `choice`
--

INSERT INTO `choice` (`ID`, `SID`, `UID`, `source`, `content`, `A`, `B`, `C`, `D`, `answer`, `resolve`, `type`, `score`, `time`) VALUES
(1, '1', '1', '三亿文库', '在数据管理技术的发展过程中，经历了人工管理阶段、文件系统阶段和数据库系统阶段。\r\n在这几个阶段中，数据独立性最高的是（  ）阶段', '数据库系统 ', '文件系统 ', '人工管理 ', '数据项管理', 'A', '无', 'choice', 1, '2017-08-22 05:27:39'),
(2, '1', '1', '三亿文库', '数据库三级视图，反映了三种不同角度看待数据库的观点，用户眼中的数据库称为（ ）。', '存储视图 ', '概念视图 ', '内部视图', '外部视图', 'D', '无', 'choice', 1, '2017-08-22 06:18:33'),
(3, '1', '1', '三亿文库', '数据库中，数据的物理独立性是指（ ）。', '数据库与数据库管理系统的相互独立', '用户程序与DBMS的相互独立', '用户的应用程序与存储在磁盘上的数据库中的数据是相互独立的', '应用程序与数据库中数据的逻辑结构相互独立', 'C', '无', 'choice', 1, '2017-08-22 16:29:14'),
(4, '1', '1', '三亿文库', '下面的两个关系中，职工号和设备号分别为职工关系和设备关系的关键字： 职工（职工号，职工名，部门号，职务，工资） 设备（设备号，职工号，设备名，数量）\r\n两个关系的属性中，存在一个外关键字为（  ）。', '职工关系的“职工号”', ' 职工关系的“设备号”', ' 设备关系的“职工号”', '设备关系的“设备号”', 'C', '无', 'choice', 1, '2017-08-22 16:33:56'),
(5, '1', '1', '三亿文库', '事务的原子性是指（ ）。', '事务一旦提交，对数据库的改变是永久的', '事务中包括的所有操作要么都做，要么都不做', '一个事务内部的操作及使用的数据对并发的其他事务是隔离的', '事务必须使数据库从一个一致性状态变到另一个一致性状态', 'B', '无', 'choice', 1, '2017-08-22 16:33:56'),
(6, '1', '1', '三亿文库', '下列哪些运算是关系代数的基本运算', '交、并、差', '投影、选取、除、联结', '联结、自然联结、笛卡尔乘积', ' 投影、选取、笛卡尔乘积、差运算', 'D', '无', 'choice', 1, '2017-08-22 16:35:15'),
(7, '1', '1', '三亿文库', '关系模型中3NF是指（）。', '满足2NF且不存在传递依赖现象', '满足2NF且不存在部分依赖现象', '满足2NF且不存在非主属性', '满足2NF且不存在组合属性', 'A', '无', 'choice', 1, '2017-08-22 16:40:24'),
(8, '1', '1', '三亿文库', '候选码中的属性可以有（ ）。', ' 0个', ' 1个', ' 1个或多个', '多个', 'C', '无', 'choice', 1, '2017-08-22 16:43:38'),
(9, '1', '1', '三亿文库', '在关系模式R(A,B,C,D)中，有函数依赖集F={B→C,C→D,D→A}，则R能达到', '1NF', '2NF', ' 3NF ', '以上三者都不行', 'B', '无', 'choice', 1, '2017-08-22 16:43:42'),
(10, '4', '1', '三亿文库', '中国封建社会的文化思想体系以（）为核心。', '儒家思想', '道家思想', '墨家思想', '佛教思想', 'A', '无', 'choice', 1, '2017-08-22 18:10:40'),
(11, '4', '1', '三亿文库', '世界历史开始进入资本主义时代的标志性事件是（）。', '1640年英国资产阶级革命', '1680年俄国彼得一世改革', '1789年法国大革命', '1868年日本明治维新', 'A', '无', 'choice', 1, '2017-08-22 18:11:54'),
(12, '4', '1', '三亿文库', '19世纪末资本主义进入帝国主义阶段后，（）成为殖民主义剥削的重要形式，并出现瓜分世界的狂潮。', '商品输出', '资本输出', '贩卖奴隶', '掠夺土地', 'B', '无', 'choice', 1, '2017-08-22 18:13:12'),
(13, '4', '1', '三亿文库', '鸦片战争以清政府的失败而告终。1842年8月29日，清政府与英国签订了中国近代史上的第一个不平等条约是（）。', '中英《南京条约》', '中英《虎门条约》', '中美《望厦条约》', '中法《黄埔条约》', 'A', '无', 'choice', 1, '2017-08-22 18:14:11'),
(14, '4', '1', '三亿文库', '鸦片战争后，中国经济逐渐被卷入世界资本主义市场，其对中国的影响不包括（）。', '自给自足的自然经济逐步解体。', '西方的先进生产技术逐步传入中国。', '英国对华输出商品激增', '封建地主土地所有制瓦解。 ', 'D', '无', 'choice', 1, '2017-08-22 18:15:16'),
(15, '4', '1', '三亿文库', '近代中国的社会性质是（）。', '半殖民地社会', '半封建社会', '半殖民地半封建社会', '不完全的殖民地社会 ', 'C', '无', 'choice', 1, '2017-08-22 18:16:07'),
(16, '2', '1', '三亿文库', '下述哪一条是顺序存储结构的优点?', '插入运算方便', '可方便地用于各种逻辑结构的存储表示', '存储密度大', '删除运算方便', 'C', '无', 'choice', 1, '2017-09-21 10:38:14'),
(17, '2', '1', '三亿文库', '下面关于线性表的叙述中，错误的是哪一个?', '线性表采用顺序存储，必须占用一片连续的存储单元', '线性表采用顺序存储，便于进行插入和删除操作。', '线性表采用链式存储，不必占用一片连续的存储单元', '线性表采用链式存储，便于进行插入和删除操作。', 'B', '无', 'choice', 1, '2017-09-21 10:38:14'),
(18, '5', '1', '三亿文库', '某8位微型计算机地址码为20位，使用8K*4b的RAM芯片组成最大空间的存储器，则需要几\r\n个RAM芯片。\r\n', '256', '128', '64', '32', 'B', '无', 'choice', 1, '2017-09-21 10:44:47'),
(19, '5', '1', '三亿文库', 'CPU响应中断的时间是_______。', '一条指令执行结束', '取指周期开始', '取指周期结束', '外设提出中断', 'A', '无', 'choice', 1, '2017-09-21 10:44:47'),
(20, '3', '1', '三亿文库', '马克思主义的直接理论来源没有下列哪一项', '德国古典哲学', '英国的古典政治经济学', '英法两国的空想社会主义学说', '自由主义经济学', 'D', '无', 'choice', 1, '2017-09-21 10:50:09'),
(21, '3', '1', '三亿文库', '历史人物的作用不表现为', '是历史进程的决定者', '是历史事件的发动者', '决定历史事件的个别特点和面貌', '是历史事件的组织者和领导者', 'A', '无', 'choice', 1, '2017-09-21 10:50:09');

--
-- 触发器 `choice`
--
DROP TRIGGER IF EXISTS `Tri_Time`;
DELIMITER $$
CREATE TRIGGER `Tri_Time` BEFORE INSERT ON `choice` FOR EACH ROW BEGIN 
set new.time=now();
END
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- 替换视图以便查看 `choice_view`
-- (See below for the actual view)
--
DROP VIEW IF EXISTS `choice_view`;
CREATE TABLE IF NOT EXISTS `choice_view` (
`name` varchar(20)
,`ID` bigint(20)
,`SID` varchar(20)
,`UID` varchar(20)
,`source` varchar(50)
,`content` varchar(500)
,`A` varchar(50)
,`B` varchar(50)
,`C` varchar(50)
,`D` varchar(50)
,`answer` char(1)
,`resolve` varchar(500)
,`type` char(6)
,`score` tinyint(4)
,`time` datetime
);

-- --------------------------------------------------------

--
-- 表的结构 `judge`
--

DROP TABLE IF EXISTS `judge`;
CREATE TABLE IF NOT EXISTS `judge` (
  `ID` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '判断题号',
  `SID` varchar(20) DEFAULT '1' COMMENT '科目号',
  `UID` varchar(20) DEFAULT '1' COMMENT '上传老师',
  `source` varchar(50) DEFAULT '百度文库' COMMENT '试题来源',
  `content` varchar(500) DEFAULT NULL COMMENT '试题内容',
  `answer` bit(1) DEFAULT NULL COMMENT '试题答案（1表对）',
  `resolve` varchar(500) DEFAULT NULL COMMENT '试题解析',
  `type` varchar(6) DEFAULT 'judge' COMMENT '试题类型',
  `score` tinyint(4) DEFAULT '1' COMMENT '分数',
  `time` datetime DEFAULT NULL COMMENT '上传时间',
  PRIMARY KEY (`ID`),
  KEY `SID` (`SID`),
  KEY `TID` (`UID`)
) ENGINE=MyISAM AUTO_INCREMENT=28 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `judge`
--

INSERT INTO `judge` (`ID`, `SID`, `UID`, `source`, `content`, `answer`, `resolve`, `type`, `score`, `time`) VALUES
(1, '1', '1', '百度文库', 'SQL语言是关系数据库的标准语言\r\n', b'1', '无', 'judge', 1, '2017-08-01 08:27:40'),
(2, '1', '1', '百度文库', '连接是关系运算中的传统集合运算 ', b'1', '无', 'judge', 1, '2017-08-22 17:12:20'),
(3, '1', '1', '百度文库', '数据库管理系统的英文缩写是DBA ', b'0', '无', 'judge', 1, '2017-08-22 17:18:49'),
(4, '1', '1', '百度文库', '候选关键字中的属性称为主属性', b'1', '无', 'judge', 1, '2017-08-22 17:18:49'),
(5, '1', '1', '百度文库', '数据操作是对数据库系统的动态特性的描述', b'1', '无', 'judge', 1, '2017-08-22 17:18:49'),
(6, '1', '1', '百度文库', '外关键字是E－R模型的基本要素 ', b'0', '无', 'judge', 1, '2017-08-22 17:18:49'),
(7, '1', '1', '百度文库', '关系数据库是采用关系模型作为数据的组织方式', b'1', '无', 'judge', 1, '2017-08-22 17:18:49'),
(8, '1', '1', '百度文库', '扩展名ndf的文件是主数据文件', b'0', '无', 'judge', 1, '2017-08-22 17:18:49'),
(9, '1', '1', '百度文库', '数据定义功能是数据库管理系统的主要功能之一', b'1', '无', 'judge', 1, '2017-08-22 17:18:49'),
(10, '1', '1', '百度文库', '关系中的属性是可分解的', b'0', '无', 'judge', 1, '2017-08-22 17:18:49'),
(11, '1', '1', '百度文库', '存储过程的输出结果可以传递给一个变量。', b'1', '无', 'judge', 1, '2017-08-22 17:39:00'),
(12, '4', '1', '百度文库', '只有通过革命获得民族独立、人民解放以后,中国人民才可能集中力量进行现代化建设,实现国家富强、人民富裕.', b'1', '无', 'judge', 1, '2017-08-22 17:51:15'),
(13, '4', '1', '百度文库', '近代中国诞生的新的被压迫阶级是工人阶级.', b'1', '无', 'judge', 1, '2017-08-22 17:51:16'),
(14, '4', '1', '百度文库', '中国近代最早的带有资本主义色彩的社会方案是《资政新篇》.', b'1', '无', 'judge', 1, '2017-08-22 17:53:20'),
(15, '4', '1', '百度文库', '洋务运动客观上促进了中国早期工业化和民族资本主义的产生与发展.', b'1', '对', 'judge', 1, '2017-08-22 17:53:39'),
(16, '4', '1', '百度文库', '科举制废除于洋务运动时期.', b'0', '是错的,选举制废除于1905年,而洋务运动是19世纪90年代结束.\r\n', 'judge', 1, '2017-08-22 17:54:07'),
(17, '4', '1', '百度文库', '辛亥革命结束了中国半殖民地半封建社会的状况.', b'1', '无', 'judge', 1, '2017-08-22 17:54:44'),
(18, '4', '1', '百度文库', '北洋军阀是在清末由袁世凯一手培植的反动政治武装集团', b'0', '是错的,北洋军阀,民国军阀势力之一,由袁世凯掌权后的「北洋新军」主要将领组成.它产生于清末,但主要活动是在民国时期,1928年灭亡.\r\n', 'judge', 1, '2017-08-22 17:55:14'),
(19, '4', '1', '百度文库', '第一次国共合作时期的“三大政策”是联俄、联共、扶助农工.', b'1', '无', 'judge', 1, '2017-08-22 17:55:49'),
(20, '4', '1', '百度文库', '中国共产党刚成立时,其主体是知识分子', b'1', '对', 'judge', 1, '2017-08-22 17:56:05'),
(21, '4', '1', '百度文库', '大革命后期中共中央领导机关犯了“左”倾机会主义错误.', b'0', '是错的,大革命后期中共中央领导机关犯了“右”倾机会主义错误　\r\n', 'judge', 1, '2017-08-22 17:56:39'),
(22, '2', '1', '百度文库', '和顺序栈相比，链栈有一个比较明显的优势是通常不会出现栈满的情况', b'1', NULL, 'judge', 1, '2017-09-21 10:40:27'),
(23, '2', '1', '百度文库', '若串S＝‘software’，其子串的数目是9', b'0', NULL, 'judge', 1, '2017-09-21 10:40:27'),
(24, '5', '1', '百度文库', '某一RAM芯片，其容量为64K×16位（行列地址不复用），除电源和接地端外，该芯片引出线最少数目是 34      ', b'1', NULL, 'judge', 1, '2017-09-21 10:42:42'),
(25, '5', '1', '百度文库', '组合逻辑控制器是由硬件电路构成的', b'1', NULL, 'judge', 1, '2017-09-21 10:42:42'),
(26, '3', '1', '百度文库', '劳动力是任何社会生产的基本要素，在特定的社会发展阶段和特定的历史条件下，劳动力作为一种特殊商品，其价值的构成包括维持劳动者自身性命所必需的生活资料的价值', b'1', NULL, 'judge', 1, '2017-09-21 10:51:36'),
(27, '3', '1', '百度文库', '共产主义社会的基本特征是物质财富极大丰富，消费资料“按需分配”；社会关系高度和谐，人们精神境界极大提高；每个人自由而全面发展，人类从必然王国向自由王国的飞跃。', b'1', NULL, 'judge', 1, '2017-09-21 10:51:36');

--
-- 触发器 `judge`
--
DROP TRIGGER IF EXISTS `tri_judge`;
DELIMITER $$
CREATE TRIGGER `tri_judge` BEFORE INSERT ON `judge` FOR EACH ROW BEGIN 
set new.time=now();
END
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- 替换视图以便查看 `judge_view`
-- (See below for the actual view)
--
DROP VIEW IF EXISTS `judge_view`;
CREATE TABLE IF NOT EXISTS `judge_view` (
`name` varchar(20)
,`ID` bigint(20)
,`SID` varchar(20)
,`UID` varchar(20)
,`source` varchar(50)
,`content` varchar(500)
,`answer` bit(1)
,`resolve` varchar(500)
,`type` varchar(6)
,`score` tinyint(4)
,`time` datetime
);

-- --------------------------------------------------------

--
-- 表的结构 `page`
--

DROP TABLE IF EXISTS `page`;
CREATE TABLE IF NOT EXISTS `page` (
  `ID` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '试卷号',
  `name` varchar(20) DEFAULT NULL COMMENT '试卷名',
  `SID` varchar(20) DEFAULT NULL COMMENT '科目号',
  `UID` varchar(20) DEFAULT NULL COMMENT '上传教师',
  `startTime` datetime DEFAULT NULL COMMENT '考试开始时间',
  `endTime` datetime DEFAULT NULL COMMENT '考试结束时间',
  `time` datetime DEFAULT NULL COMMENT '上传时间',
  `paw` varchar(20) NOT NULL COMMENT '考试密码',
  PRIMARY KEY (`ID`),
  KEY `SID` (`SID`),
  KEY `TID` (`UID`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `page`
--

INSERT INTO `page` (`ID`, `name`, `SID`, `UID`, `startTime`, `endTime`, `time`, `paw`) VALUES
(1, '近代史试卷', '4', '1', '2017-08-01 00:00:00', '2017-08-08 00:00:00', '2017-10-30 07:18:26', ''),
(2, '数据库试卷', '1', '1', '2017-08-02 00:00:00', '2017-08-04 00:00:00', '2017-10-29 06:17:17', ''),
(3, '马克思试卷', '3', '2', '2017-09-05 08:13:00', '2017-09-19 08:12:00', '2017-10-29 08:13:20', ''),
(4, '计组试卷', '5', '2', '2017-09-04 09:00:25', '2017-12-30 00:00:32', '2017-09-20 23:14:59', ''),
(5, '数据结构试卷', '2', '2', '2017-09-25 06:18:27', '2017-12-30 10:30:33', '2017-09-20 23:35:55', '');

--
-- 触发器 `page`
--
DROP TRIGGER IF EXISTS `tri_page_copy`;
DELIMITER $$
CREATE TRIGGER `tri_page_copy` BEFORE INSERT ON `page` FOR EACH ROW BEGIN 
DECLARE CID BIGINT;
set CID=(select ID  from page order by ID DESC LIMIT 1);
SET new.ID=CID+1;
set new.time=now();
END
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- 表的结构 `pagedetail`
--

DROP TABLE IF EXISTS `pagedetail`;
CREATE TABLE IF NOT EXISTS `pagedetail` (
  `PID` bigint(20) NOT NULL DEFAULT '1' COMMENT '试卷号',
  `TID` bigint(20) NOT NULL COMMENT '试题号',
  `type` varchar(20) NOT NULL DEFAULT 'choice' COMMENT '试题类型',
  `content` varchar(1000) NOT NULL COMMENT '试题内容',
  `A` varchar(100) DEFAULT NULL,
  `B` varchar(100) DEFAULT NULL,
  `C` varchar(100) DEFAULT NULL,
  `D` varchar(100) DEFAULT NULL,
  `answer` varchar(1000) NOT NULL COMMENT '试题答案',
  `score` float NOT NULL DEFAULT '1.5' COMMENT '分值',
  PRIMARY KEY (`PID`,`TID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='试卷题库表';

--
-- 转存表中的数据 `pagedetail`
--

INSERT INTO `pagedetail` (`PID`, `TID`, `type`, `content`, `A`, `B`, `C`, `D`, `answer`, `score`) VALUES
(1, 1, '选择题', '近代中国睁眼看世界的第一人是（ ）', '魏源', '龚自珍', '林则徐　', '李鸿章', 'C', 1.5),
(1, 2, '选择题', '近代中国沦为半殖民地半封建社会，其根本原因在于（   ）。', '封建统治者的腐败 ', '农民小资产阶级的落后', '帝国主义列强的入侵   ', '民族资产阶级的软弱', 'A', 1.5),
(1, 3, '选择题', '中国旧式农民战争的最高峰是（  ）', '义和团运动', '三元里人民抗英斗争', '太平天国起义   ', '反教会斗争', 'C', 1.5),
(1, 4, '选择题', '洋务派倡导洋务运动的根本目的是 （    ）。', '维护封建经济', '发展资本主义   ', '维护封建统治   ', '抵抗外国侵略', 'C', 1.5),
(1, 5, '选择题', '中国工人阶级以独立的姿态登上政治舞台是在（）', '辛亥革命中', '新文化运动中', '五四运动中 ', '国民革命运动中', 'C', 1.5),
(1, 6, '选择题', '井冈山时期，毛泽东提出红色政权存在与发展必须坚持（   ）', '武装斗争、土地革命、根据地建设 ', '党的建设、武装斗争、土地革命', '党的建设、武装斗争、统一战线', '武装斗争、土地革命、统一战线', 'A', 1.5),
(1, 7, '选择题', '全国抗日战争开始的事件是（   ）', '“九·一八”事变', '“一·二八”事变', '“七·七”事变  ', '“八·一三”事变', 'C', 1.5),
(1, 8, '选择题', '抗日战争进入相持阶段后，日本帝国主义对国民党政府采取的政策是（  ） ', '以军事打击为主，政治诱降为辅', '以政治诱降为主，军事打击为辅', '军事打击和政治诱降并重 ', '速战速决，武力征服 ', 'B', 1.5),
(1, 9, '选择题', '“芝麻赛玉米，玉米比人大”。这句出现于20世纪50年代的打油诗反映的是()', '土地改革的成果  ', '农业合作社的优越性', '“一五”计划的建设成就 ', '“大跃进”时的浮夸风', 'D', 1.5),
(1, 10, '选择题', '在中国共产党十一届三中全会上()', '通过了《关于建国以来党的若干历史问题的决议》', '提出了建立社会主义市场经济体制的目标', '阐明了社会主义初级阶段的理论 ', '作出了以经济建设为中心，实行改革开放的伟大决策', 'D', 1.5),
(1, 11, '选择题', '洋务运动失败的原因不包括（ ）', '洋务运动具有封建性 ', '洋务运动对外国具有依赖性', '没有相对稳定的“和平环境”　', '洋务企业的管理具有腐朽性．', 'C', 1.5),
(1, 12, '选择题', '关于马克思主义在中国的传播，下列叙述中不正确的是（  ）       ', '最早在中国介绍马克思主义的是李大钊　', '十月革命后马克思主义才在中国开始传播开来', '五四运动后马克思主义在中国得以广泛传播　', '马克思主义在中国的传播是一帆风顺的', 'D', 1.5),
(1, 13, '选择题', '1、中国封建社会的基本生产结构是(    )', '手工业', '农业经济', '工业', '小农经济', 'D', 1.5),
(1, 14, '选择题', '中国封建社会政治的基本特征是(    )\r\n', '高度中央集权的封建君主专制 ', '族权和政权相结合\r\n', '国家统一和各民族经济文化紧密联系', '结构稳定、延续，发展缓慢、迟滞\r\n', 'A', 1.5),
(1, 15, '选择题', '能够比较典型反映太平天国农民政权特点的是(    )', '《资政新篇》', '《万大洪告示》', '《劝世良言》', '《天朝田亩制度》', 'D', 1.5),
(1, 16, '选择题', '太平天国由盛转衰的标志是(    )\r\n', '天京事变', '石达开西征', '李开芳北伐', '天京陷落 ', 'A', 1.5),
(1, 17, '选择题', '科举制是清政府在下列哪次活动中废除的？(    )\r\n', '洋务运动\r\n', '戊戌变法', '清末“新政”\r\n', '“预备仿行宪政”\r\n', 'C', 1.5),
(1, 18, '选择题', '辛亥革命的中坚力量是(    )\r\n', '资产阶级工商业者\r\n', '华侨', '会党\r\n', '留学生为骨干的青年知识分子', 'D', 1.5),
(1, 19, '判断题', '问题与主义”争论的双方主要人物是陈独秀与胡适\r\n', '', '', '', '', '0', 1.5),
(1, 20, '判断题', '中国共产党就国共合作的方针和方法做出正式决定的是在中共“三大”会议上', '', '', '\r\n', '', '1', 1.5),
(1, 21, '简答题', '“鸦片战争一声炮响，给中国带来了近代文明”。', '', '', '', '', '答：错误。（2分） (1)帝国主义侵略中国的目的不是要把封建的中国变成资本主义的中国，而是要把中国变成它的殖民地。（2分）(2)帝国主义的侵略和压迫给中华民族和中国人民带来了深重的灾难，使中国经济文化不能发展，政治不能进步。（1分）(3)帝国主义侵略客观上刺激了中国资本主义因素的发展和先进科学技术的采用，但同帝国主义侵略所造成的灾难相比是微不足道的。（2分）(4)侵略有功论美化帝国主义侵略，损害了中国人民民族自尊心和自信心，只能使中国成为发达资本主义国家的附庸。（1分）', 10),
(1, 22, '简答题', '中华人民共和国的成立，标志着中国已经从半殖民地半封建社会进入到社会主义社会。', '', '', '', '', '答：此观点错误。（2分）中华人民共和国的成立，只是开始了从新民主主义社会到社会主义社会的过渡，并没有完成这个转变。（3分）到1956年社会主义改造基本完成，确立了生产资料公有制，社会主义基本制度在我国确立起来，才实现了从新民主主义社会到社会主义社会的转变。（3分）\r\n\r\n', 10),
(1, 23, '简答题', '1、中国近代历次反侵略战争失败的根本原因和教训是什么？', '', '', '', '', '第一：近代中国社会政治制度的腐败和清政府的腐朽无能，是反侵略战争失败的一个重要原因。（2分）\r\n第二：经济和科学技术的落后，国家综合实力低，是近代中国反侵略战争失败的另一重要原因。（2分）\r\n教训：第一：在中国要争取国家独立和民族富强 ，必须改变帝国主义、封建主义联合统治的半殖民地半封建的社会制度。帝国主义侵略是造成中国人民巨大灾难的根源，与此同时，腐败的清政府也已失去了领导中国人民进行反侵略战争胜利的能力和资格。而清政府之所以丧失了这种能力，从根本上上说，是封建专制制度造成的。因此，反对帝国主义侵略，同', 10),
(1, 24, '简答题', '2、为什么说孙中山领导的辛亥革命引起了近代中国的历史性巨大变化？', '', '', '', '', '第一，辛亥革命推翻了封建势力的政治代表、帝国主义在中国的代理人——清王朝的统治，沉重打击了中外反动势力，使中国反动统治者在政治上乱了阵脚。（2分）\r\n第二，辛亥革命结束了统治中国两千多年的封建君主专制制度，建立了中国历史上第一个资产阶级共和政府，使民主共和的观念开始深入人心，并在中国形成了“敢有帝制自为者，天下共击之”的民主主义观念。（2分）\r\n第三，辛亥革命给人们带来一次思想上的解放。（1分）\r\n第四，辛亥革命促使社会经济、思想习惯和社会风俗等方面发生了新的积极变化。（2分）\r\n第五，辛亥革命不仅在一定', 10),
(1, 25, '简答题', '为什么说中国共产党是中国人民抗日战争的中流砥柱？', '', '', '', '', '第一，中国共产党积极倡导、促成、维护抗日统一战线，最大限度动员全国军民共同抗战成为凝聚全民族抗战力量的杰出组织者和鼓舞着。（2分）\r\n第二，以毛泽东为首的中国共产党人，把马克思列宁主义基本原理同中国具体实践相结合，创立和发展了毛泽东思想。制定、实施了一套完整的抗战策略和方针，提出了持久抗战的战略思想，对抗战胜利发挥了重要作用。（2分）\r\n第三，中国共产党通过游击战开辟敌后战场，建立抗日根据地，牵制和消灭了日军大量有生力量，减轻了正面战场的压力，也为抗日战争的战略返攻准备了条件。（2分）\r\n第四，中国共产党', 10),
(1, 26, '简答题', '十一届三中全会以来，中国特色社会主义事业取得了哪些主要成就？其原因是什么？', '', '', '', '', '第一、国民经济保持持续健康快速发展，现代化建设事业稳步推进，综合国力和国际竞争力显著提高，人民生活总体上达到小康水平。（1分）\r\n    第二、社会主义市场经济体制初步建立并不断完善，各项改革事业取得重大进展。（1分）\r\n第三、全方位对外开放取得新突破，形成全方位、多层次、宽领域的对外开放格局。（1分）\r\n第四、社会主义民主政治建设取得重要进展。（1分）\r\n第五、社会主义精神文明建设成效显著。（1分）\r\n第六、民族政策和宗教政策得到全面贯彻。（1分）\r\n第七、祖国统一大业取得进展。（1分）\r\n第八、国防和', 10),
(1, 27, '简答题', '怎样理解社会主义制度在中国的确立是历史和人民的选择？', '', '', '', '', '答：近代以来，中国面临着争取民族独立、人民解放和实现国家的繁荣富强即实现国家经济的现代化这样两项根本性的历史任务。1949年中华人民共和国的成立，标志着第一项历史任务的基本实现。随着民主革命遗留任务的完成和国民经济的恢复，集中力量进行经济建设即为实现第二项历史任务而奋斗，被突出地提上了党和国家的议事日程。进行经济建设，首先要把中国从一个落后和农业国变为一个先进的工业国，实现国家的工业化。怎样才能发展经济，实现国家的工业化？①从世界历史上看，主要有两条道路：一条是资本主义工业化的道路，这是欧洲各国、美国和日', 10),
(2, 1, '选择题', '次数据文件用于存储不能存在主数据文件中的数据，默认扩展名为（ ）', 'ndf', 'mdf', 'log', 'dat', 'A', 2),
(2, 2, '选择题', '关系模型中数据的逻辑结构是一张二维表，它由（ ）组成。', '行和列', '行 ', '关系', '列', 'A', 2),
(2, 3, '选择题', '一个查询的结果成为另一个查询的条件，这种查询被称为（）。', '连接查询', '内查询', '自查询', '子查询 ', 'D', 2),
(2, 4, '选择题', 'SELECT语句中下列（B）子句用于对数据按照某个字段分组（）子句用于对分组统计进一步设置条件', 'HAVING子句 ', 'GROUP BY 子句', 'ORDER BY 子句', 'WHERE子句 ', 'A', 2),
(2, 5, '选择题', '在SELECT语句中，下列子句用于对搜索的结果进行排序（ ）。 ', 'HAVING子句', 'GROUP BY 子句  ', 'ORDER BY 子句', 'WHERE子句 ', 'C', 2),
(2, 6, '选择题', '修改视图时，使用（ ）选项，可以对CREATE VIEW的文本进行加密。 ', 'WITH ENCRYPTION', 'WITH  CHECK  OPTION', 'VIEW _METADATA', 'AS   SQL语句', 'A', 2),
(2, 7, '选择题', '与WHERE AGE BETWEEN 18 AND 23完全等价的是（ ）。', 'WHERE AGE＞18 AND AGE＜23 ', 'WHERE AGE＞＝18 AND AGE＜23 ', 'WHERE AGE＞18 AND AGE＜＝23', 'WHERE AGE＞＝18 AND AGE＜＝23', 'D', 2),
(2, 8, '选择题', '创建视图命令是（）', 'CREATE VIEW', 'DROP VIEW', 'CREATE TABLE ', 'CREATE RULE  ', 'A', 2),
(2, 9, '选择题', '在SELECT语句中，如果想要返回的结果集中不包含相同的行，应该使用关键字（ ）。', 'TOP', 'AS', 'DISTINCT ', 'JOIN ', 'C', 2),
(2, 10, '选择题', '在SELECT语句中，下列子句用于将查询结果存储在一个新表中（ ）。 ', 'SELECT子句', 'INTO子句 ', 'FROM 子句', 'WHERE子句 ', 'B', 2),
(2, 11, '选择题', '为了对表中的各行进行快速访问，应对此表建立（ ）', '约束', '规则 ', '索引', '视图', 'D', 2),
(2, 12, '选择题', '通过CREATE TABLE语句或者其他方法创建了一个表后，可以使用（）语句在表中添加记录。 ', 'DELETE', 'INSERT', 'UPDATE', 'INSEATER ', 'B', 2),
(2, 13, '选择题', '（）在定义列时，它可以为表中的指定列提供默认值。 ', 'FOREIGN约束', 'DEFAULT约束 ', 'UNIQUE约束', 'CHECK', 'D', 2),
(2, 14, '判断题', '单击【查询编辑器】窗口中的任意位置按Shift+Alt+Enter命令可以在全屏显示模式和常规显示模式之间进行切换', '', '', '', '', '1', 2),
(2, 15, '判断题', 'CHECK约束在定义列时，它可以为表中的指定列提供默认值。', '', '', '', '', '0', 2),
(2, 16, '简答题', '数据库管理系统的构成有哪些？', '', '', '', '', '数据库系统DBS通常由软件、数据库和数据管理员组成。其软件主要包括操作系统、各种宿主语言、实用程序以及数据库管理系统。数据库由数据库管理系统统一管理，数据的插入、修改和检索均要通过数据库管理系统进行。数据管理员负责创建、监控和维护整个数据库，使数据能被任何有权使用的人有效使用。数据库管理员一般是由业务水平较高、资历较深的人员担任。', 7),
(2, 17, '简答题', '数据模型有哪些？', '', '', '', '', '面向对象，层次模型、 关系模型、网状模型', 7),
(2, 18, '简答题', '数据完整性有哪些？', '', '', '', '', '实体完整性约束，  参照完整性约束， 用户自定义完整性', 7),
(2, 19, '简答题', '数据库对象有哪些？(至少5个) ', '', '', '', '', '表 视图 索引 约束 触发器 默认值', 7),
(2, 20, '简答题', '数据库文件有哪3类？', '', '', '', '', '主数据文件 次数据文件 日志文件', 7),
(2, 21, '简答题', '数据库管理经历了哪3个阶段？', '', '', '', '', '人工管理、文件系统和数据库管理系统', 7),
(2, 22, '简答题', '创建T表（教师基本情况表）\r\n(TNO,TN,SEX,AGE,PROF,SAL,DEPT)分别表示教师的编号，姓名，性别，年龄，职称，工资，系别。TC表（教师授课表）的结构为TC(TNO,CNO)分别表示教师的编号，课程编号\r\n', '', '', '', '', 'CREATE TABLE t\r\n(\r\n	TNO char(10) NOT NULL PRIMARY KEY,/*教师编号字段*/\r\n	TN char(10) NULL,/*教师姓名字段*/\r\n	SEX char(2) NULL,/*教师性别字段*/\r\n	AGE int NULL,/*教师年龄字段*/\r\n	PROF char(20) NULL,/*教师职称字段*/\r\n	SAL int NULL,/*教师工资字段*/\r\n	DEPT char(10) NULL,/*教师所在系别字段*/ \r\n)\r\n\r\nCREAT', 7),
(2, 23, '简答题', '查询xs表中年龄在23岁以下的学生学号，姓名，出生日期。', '', '', '', '', 'select学号,姓名,出生时间 from xs where datediff(year,出生时间,getdate( ))<23', 7),
(2, 24, '简答题', '求5的阶乘 （程序控制）', '', '', '', '', 'DECLARE @r int,@times int\r\nSET @r=1\r\nSET @times=1\r\nlabel1:\r\n  SET @r=@r *@times\r\n  SET @times=@times+1\r\n  IF @times<=5\r\n    GOTO label1\r\n  PRINT\'5的阶乘为：\'+str(@r)\r\n', 7),
(2, 25, '简答题', '求1到100的和（程序控制）', '', '', '', '', 'DECLARE @i int, @sum int\r\nSET @i = 0\r\nSET @sum = 0\r\nWHILE @i >= 0 \r\n  BEGIN\r\n    SET @i = @i +1 \r\n    IF @i > 100 \r\n      BEGIN\r\n        SELECT \'1到100的和\' = @sum \r\n        BREAK \r\n      END  \r\n    ELSE\r\n      SET @sum = @sum + @i\r\n  END\r\n', 7),
(3, 1, '选择题', '1848年2月，（  ）的发表，标志着马克思主义的公开问世。', '《共产党宣言》 ', '《哲学的贫困》', '《德意志意识形态》', '《关于费尔巴哈的提纲》', 'A', 3),
(3, 2, '选择题', '马克思主义的本质特征是（ ）', '科学性', '革命性', '科学性与革命性的统一', '人本主义', 'C', 3),
(3, 3, '选择题', '马克思主义辩证的否定观认为，辩证的否定其实质就是（ ）', '扬弃', '全面肯定', '全盘否定 ', '既不肯定，也不否定', 'A', 3),
(3, 4, '选择题', '社会发展的根本动力是', '.生产力的发展  ', '人的需要', '生产关系的变革  ', '阶级斗争', 'A', 3),
(3, 5, '选择题', '认识的本质是（）', '主体对客体的能动反映', '主体对客体的被动反映', '人们的习惯性联想 ', '客体本质的主动显现', 'A', 3),
(3, 6, '选择题', '商品的价值量是由（）决定的', '社会必要劳动时间', '个别劳动时间', '工人的必要劳动', '工人的剩余劳动', 'A', 3),
(3, 7, '选择题', '在必要劳动时间不变的条件下，通过绝对延长工作时间而产生剩余价值是（）', '绝对剩余价值', '相对剩余价值', '超额剩余价值 ', '平均利润', 'A', 3),
(3, 8, '选择题', '资本有机构成的提高与工人就业状况之间的关系是（ ）', '资本有机构成提高导致工人充分就业', '资本有机构成提高导致工人失业', '资本有机构成提高与工人就业状况之间没有必然的联系', '.资本有机构成提高使工人就业保持平稳', 'B', 3),
(3, 9, '选择题', '下列哪个国家是总统共和政体的代表', '日本', '美国', '英国 ', '德国', 'B', 3),
(3, 10, '选择题', '资本主义社会的国民收入初次分配中，对于雇佣工人而言，通行的分配规律是（ ）', '按劳分配', '按资分配', '按劳动力价值分配    ', '按能力分配', 'C', 3),
(3, 11, '选择题', ' 在资本主义经济运行中，始终贯穿着的一个基本矛盾是（ ）', '.社会主义与资本主义之间的矛盾', '无产阶级与资产阶级之间的矛盾', '生产社会化与资本主义私人占有制之间的矛盾', '通货膨胀与通货紧缩之间的矛盾', 'C', 3),
(3, 12, '选择题', '社会主义产生的根本途径是（ ）', '让资产阶级进行温和改革', '阶级调和', '大力发展社会生产力  ', '无产阶级革命', 'D', 3),
(3, 13, '选择题', '在下列经济行为中，属于货币执行支付手段职能的是(   )', '顾客用1万元钱可购买2台冰箱', '顾客用1万元购买了黄金，并贮藏起来', '顾客用1万元钱购买了2台冰箱 ', '顾客购买2台冰箱，一周后付款1万元', 'D', 3),
(3, 14, '判断题', '自由是对必然的认识和对客观世界的改造', '', '', '', '', '1', 3),
(3, 15, '判断题', '马克思主义认为，在其现实性上，人的本质是万物之灵', '', '', '', '', '0', 3),
(3, 16, '简答题', '既然社会存在决定社会意识，那么，为什么同一时代条件下人们的思想观念却丰富多彩差异很大甚至完全对立呢？ ', '', '', '', '', '1，	社会意识不是消极被动地反映客观实在，它具有相对独立性，有自己特有的发展形式和规律。首先，社会意识与社会存在具有不平衡性。在同样的社会存在条件下，不同社会主体可能会产生不同的反映。其次，社会意识诸形式均有自成系统、前后相继的 历史链条，各自具有历史的继承性。这些意识在相互间的影响中会有其不同反应。第三，社会意识具有相对独立性。正因如此，处于同一时代条件下人们的思想、观 念会丰富多彩，出现很大差异甚至产生对立。', 11),
(3, 17, '简答题', '为什么说实践是检验真理的唯一标准？', '', '', '', '', '2，	这是由真理的本性和实践的特征所决定的。真理的本性跨主客两界，这决定了其检验标准也必须是跨主客两界，实践刚好符合这个标准。实践具有直观现实性，可以将人们的认识直观地展示出来。', 11),
(3, 18, '简答题', '唯物辩证法的三大规律是指哪些规律？', '', '', '', '', '3，	唯物辩证法的三大规律是：对立统一规律，质量互变规律，否定之否定规律。', 11),
(3, 19, '简答题', '商品的两要素是什么？劳动的两重性指什么？商品的两要素与劳动的两重性之间是什么关系？', '', '', '', '', '4，	商品的二要素指商品的使用价值与价值。生产商品的劳动的二重性是指具体劳动和抽象劳动。劳动的二重性决定商品的二要素，具体来讲就是具体劳动生产商品的使用价值，抽象劳动生产商品的价值。', 11),
(3, 20, '简答题', '共产主义社会的基本特征是什么？', '', '', '', '', '5，	共产主义社会的基本特征如下：物质财富极大丰富，消费资料“按需分配”；社会关系高度和谐，人们精神境界极大提高；每个人自由而全面发展，人类从必然王国向自由王国的飞跃。', 11),
(4, 8, '选择题', '冯诺依曼结构的计算机由以下组成部分______。', '控制器和存储器', '运算器和控制器', '运算器、控制器和主存', 'CPU、主存和I/O', 'D', 5),
(4, 7, '选择题', '下列说法中_______不正确的。', '指令周期等于机器周期整数倍', '指令周期大于机器周期  ', '指令周期是机器周期的两倍', '指令周期只能是机器周期的一倍', 'C', 5),
(4, 6, '选择题', '在CPU的寄存器中，____对用户是完全透明的', 'PC', 'MAR', 'PSW', 'DAR', 'B', 5),
(4, 3, '选择题', '在对W寄存器的实验中，将数据11H存储到W寄存器，则要求WEN为    。', '1', '0', '11', '22', 'B', 5),
(4, 4, '选择题', '磁盘的转速为3600转/分，则平均等待时间是多少 秒。', '1月 60', '1/120', '60', '120', 'B', 5),
(4, 5, '选择题', '已知 100H： MOV A，#30 （双字节指令，100H为该指令的首地址）在取指令操作之后，PC的值是_____.', '0FFH', '101H', '102H', '103H', 'C', 5),
(4, 2, '选择题', '下列叙述中    是正确的', '控制器产生的所有控制信号称为微命令 ', '组合逻辑控制器比微程序控制器更加灵活', '组合逻辑控制器比微程序控制器更加灵活', '微处理器的程序称微程序', 'A', 5),
(4, 1, '选择题', '系统总线中的数据线、地址线和控制线是根据       什么来划分的。', '总线所处的位置', '总线的传输方向', '总线传输的内容', '总线的根数', 'C', 5),
(4, 9, '选择题', '下列_____是正确的。', '为了充分利用存储器空间，指令的长度通常可取字节的整数倍', '一地址指令是固定长度的指令', '单字长指令会降低取指令的速度', '都不正确', 'A', 5),
(4, 10, '选择题', '已知Cache的容量为16KB，内存的容量为1MB，每块16B，则在直接映像方式下一个Cache块可以与     个内存块对应。', '1', '32', '128', '64', 'D', 5),
(4, 11, '判断题', '和主存相比，辅存的特点是容量小，速度慢，成本低', '', '', '', '', '0', 5),
(4, 12, '判断题', '组合逻辑控制器是由硬件电路构成的。', '', '', '', '', '1', 5),
(4, 13, '判断题', '设【x】补=1.0000000，则 【x】原=无值     ', '', '', '', '', '1', 5),
(4, 14, '判断题', '在异步通信方式中，一帧包含：1位起始位，8位数据位，1位偶校验位，2位停止位。当所传输的数据为10111000（二进制），则校验位是     1', '', '', '', '', '0', 5),
(4, 15, '简答题', '比较程序查询方式和程序中断方式。', '', '', '', '', '程序查询方式都是由CPU执行查询指令，CPU的占有率100%；\r\n中断方式中，中断设备与CPU可以并行工作，只有当需要CPU为其服务时CPU才会执行中断服务程序。效率高于前者。\r\n', 10),
(4, 16, '简答题', '简述定点数加减运算判断溢出的方法。', '', '', '', '', '答：主要有三种：（1）同符号数相加，结果为相反数；（2）最高数值位的进位、符号位的进位进行异或运算，结果为0，没有溢出；反之，有溢出。', 10),
(4, 17, '简答题', '什么是指令周期？ ', '', '', '', '', '从一条指令的取到执行所需的时间，包括取指周期、间址周期、执行周期和中断周期', 10),
(5, 1, '选择题', '在数据结构中，从逻辑上可以把数据结构分为　 ', '动态结构和静态结构', '紧凑结构和非紧凑结构', '线性结构和非线性结构', '内部结构和外部结构', 'C', 5),
(5, 2, '选择题', '数据结构在计算机内存中的表示是指', '数据的存储结构', '数据结构　', '数据的逻辑结构', '数据元素之间的关系', 'A', 5),
(5, 3, '选择题', '在数据结构中，与所使用的计算机无关的是数据的 什么结构', '逻辑', '存储', '逻辑和存储', '物理', 'A　 ', 5),
(5, 4, '选择题', '在存储数据时，通常不仅要存储各数据元素的值，而且还要存储', '数据的处理方法', '数据元素的类型', '数据元素之间的关系　', '数据的存储方法', 'C', 5),
(5, 5, '选择题', '在决定选取何种存储结构时，一般不考虑', '各结点的值如何', '结点个数的多少', '对数据有哪些运算', '所用的编程语言实现这种结构是否方便', 'A', 5),
(5, 6, '选择题', '以下说法正确的是', '数据项是数据的基本单位', '数据元素是数据的最小单位', '数据结构是带结构的数据项的集合', '一些表面上很不相同的数据可以有相同的逻辑结构', 'D', 5),
(5, 7, '选择题', '在以下的叙述中，正确的是', '线性表的顺序存储结构优于链表存储结构', '二维数组是其数据元素为线性表的线性表', '栈的操作方式是先进先出', '队列的操作方式是先进后出', 'B', 5),
(5, 8, '选择题', '通常要求同一逻辑结构中的所有数据元素具有相同的特性，这意味着　', '数据元素具有同一特点', '不仅数据元素所包含的数据项的个数要相同，而且对应的数据项的类型要一致', '每个数据元素都一样', '数据元素所包含的数据项的个数要相等', 'B', 5),
(5, 9, '选择题', '链表不具备的特点是', '可随机访问任一结点', '插入删除不需要移动元素', '不必事先估计存储空间', '所需空间与其长度成正比', 'A', 5),
(5, 10, '选择题', '不带头结点的单链表head为空的判定条件是', 'head－＞next ＝＝NULL', 'head=＝NULL', 'head－＞next ＝＝head', 'head！＝NULL', 'A', 5),
(5, 11, '判断题', '若某表最常用的操作是在最后一个结点之后插入一个结点或删除最后一个结点，则采用带头结点的双循环链表', '', '', '', '', '1', 5),
(5, 12, '判断题', '需要分配较大空间，插入和删除不需要移动元素的线性表，其存储结构是单链表', '', '', '', '', '0', 5),
(5, 13, '判断题', '非空的循环单链表head的尾结点（由p所指向）满足p－＞next ＝＝head　', '', '', '', '', '1', 5),
(5, 14, '判断题', '如果最常用的操作是取第i个结点及其前驱，则采用顺序表存储方式最节省时间。', '', '', '', '', '1', 5),
(5, 15, '简答题', '下面程序段的时间复杂度是　\r\n　　s ＝0；\r\n　　for（ I ＝0； i＜n； i＋＋）\r\n　　for（j＝0；j＜n；j＋＋）\r\n　　s ＋＝B[i][j]；\r\n　　sum ＝ s ；\r\n', '', '', '', '', 'O（n2）　　　　　', 10),
(5, 16, '简答题', '下面程序段的时间复杂度是　\r\n　　for（ i ＝0； i＜n； i＋＋）\r\n　　for（j＝0；j＜m；j＋＋）\r\n　　A[i][j] ＝ 0；\r\n', '', '', '', '', 'O（n*m）　　　　　', 10),
(5, 17, '简答题', '下面程序段的时间复杂度是　\r\n　　i ＝ 0；\r\n　　while（i＜＝n）\r\n　　i ＝ i * 3；\r\n', '', '', '', '', 'O（log3n）　　　　　', 10);

-- --------------------------------------------------------

--
-- 替换视图以便查看 `page_view`
-- (See below for the actual view)
--
DROP VIEW IF EXISTS `page_view`;
CREATE TABLE IF NOT EXISTS `page_view` (
`pname` varchar(20)
,`UID` varchar(20)
,`sname` varchar(20)
,`PID` bigint(20)
,`TID` bigint(20)
,`type` varchar(20)
,`content` varchar(1000)
,`A` varchar(100)
,`B` varchar(100)
,`C` varchar(100)
,`D` varchar(100)
,`answer` varchar(1000)
,`score` float
);

-- --------------------------------------------------------

--
-- 替换视图以便查看 `recorder_view`
-- (See below for the actual view)
--
DROP VIEW IF EXISTS `recorder_view`;
CREATE TABLE IF NOT EXISTS `recorder_view` (
`PID` bigint(200)
,`pname` varchar(20)
,`SID` varchar(20)
,`sname` varchar(20)
,`picture` varchar(500)
,`Ascore` float
,`time` datetime
,`Scontent` varchar(1000)
);

-- --------------------------------------------------------

--
-- 表的结构 `student`
--

DROP TABLE IF EXISTS `student`;
CREATE TABLE IF NOT EXISTS `student` (
  `ID` varchar(20) NOT NULL COMMENT '学生账号',
  `paw` varchar(20) DEFAULT NULL COMMENT '密码',
  `name` varchar(20) DEFAULT NULL COMMENT '学生姓名',
  `Snum` varchar(20) DEFAULT NULL COMMENT '学号',
  `phone` varchar(20) DEFAULT NULL COMMENT '手机',
  `sex` varchar(2) DEFAULT NULL COMMENT '性别',
  `picture` varchar(200) DEFAULT NULL COMMENT '头像',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `student`
--

INSERT INTO `student` (`ID`, `paw`, `name`, `Snum`, `phone`, `sex`, `picture`) VALUES
('guest', NULL, '王丽', '201500699543', '17822719716', '女', NULL),
('1', '', '快快', '201500800544', '123', '女', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `subject`
--

DROP TABLE IF EXISTS `subject`;
CREATE TABLE IF NOT EXISTS `subject` (
  `ID` varchar(20) NOT NULL COMMENT '科目ID号',
  `name` varchar(20) DEFAULT NULL COMMENT '科目名称',
  `picture` varchar(500) NOT NULL COMMENT '图片',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `subject`
--

INSERT INTO `subject` (`ID`, `name`, `picture`) VALUES
('1', '数据库', 'images/img-1.jpg'),
('2', '数据结构', 'images/img-2.jpg'),
('3', '马克思原理', 'images/img-3.jpg'),
('4', '近代史', 'images/img-4.jpg'),
('5', '计算机组成原理', 'images/img-5.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `teacher`
--

DROP TABLE IF EXISTS `teacher`;
CREATE TABLE IF NOT EXISTS `teacher` (
  `ID` varchar(20) NOT NULL COMMENT '教师账号',
  `paw` varchar(20) DEFAULT NULL COMMENT '密码',
  `name` varchar(20) DEFAULT NULL COMMENT '教师姓名',
  `Tnum` varchar(20) DEFAULT NULL COMMENT '教工号',
  `phone` varchar(20) DEFAULT NULL COMMENT '手机号',
  `mail` varchar(40) DEFAULT NULL COMMENT '邮箱',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `teacher`
--

INSERT INTO `teacher` (`ID`, `paw`, `name`, `Tnum`, `phone`, `mail`) VALUES
('guest', NULL, '老师', '201500600567', '172812917815', '女'),
('1', NULL, '1', '1', '1', '男'),
('2', '2', '2', '2', '2', '2');

-- --------------------------------------------------------

--
-- 视图结构 `answer_view`
--
DROP TABLE IF EXISTS `answer_view`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `answer_view`  AS  select `subject`.`name` AS `name`,`answer`.`ID` AS `ID`,`answer`.`SID` AS `SID`,`answer`.`UID` AS `UID`,`answer`.`source` AS `source`,`answer`.`content` AS `content`,`answer`.`answer` AS `answer`,`answer`.`resolve` AS `resolve`,`answer`.`type` AS `type`,`answer`.`score` AS `score`,`answer`.`time` AS `time` from (`answer` join `subject`) where (`subject`.`ID` = `answer`.`SID`) ;

-- --------------------------------------------------------

--
-- 视图结构 `choice_view`
--
DROP TABLE IF EXISTS `choice_view`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `choice_view`  AS  select `subject`.`name` AS `name`,`choice`.`ID` AS `ID`,`choice`.`SID` AS `SID`,`choice`.`UID` AS `UID`,`choice`.`source` AS `source`,`choice`.`content` AS `content`,`choice`.`A` AS `A`,`choice`.`B` AS `B`,`choice`.`C` AS `C`,`choice`.`D` AS `D`,`choice`.`answer` AS `answer`,`choice`.`resolve` AS `resolve`,`choice`.`type` AS `type`,`choice`.`score` AS `score`,`choice`.`time` AS `time` from (`choice` join `subject`) where (`subject`.`ID` = `choice`.`SID`) ;

-- --------------------------------------------------------

--
-- 视图结构 `judge_view`
--
DROP TABLE IF EXISTS `judge_view`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `judge_view`  AS  select `subject`.`name` AS `name`,`judge`.`ID` AS `ID`,`judge`.`SID` AS `SID`,`judge`.`UID` AS `UID`,`judge`.`source` AS `source`,`judge`.`content` AS `content`,`judge`.`answer` AS `answer`,`judge`.`resolve` AS `resolve`,`judge`.`type` AS `type`,`judge`.`score` AS `score`,`judge`.`time` AS `time` from (`judge` join `subject`) where (`subject`.`ID` = `judge`.`SID`) ;

-- --------------------------------------------------------

--
-- 视图结构 `page_view`
--
DROP TABLE IF EXISTS `page_view`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `page_view`  AS  select `page`.`name` AS `pname`,`page`.`UID` AS `UID`,`subject`.`name` AS `sname`,`pagedetail`.`PID` AS `PID`,`pagedetail`.`TID` AS `TID`,`pagedetail`.`type` AS `type`,`pagedetail`.`content` AS `content`,`pagedetail`.`A` AS `A`,`pagedetail`.`B` AS `B`,`pagedetail`.`C` AS `C`,`pagedetail`.`D` AS `D`,`pagedetail`.`answer` AS `answer`,`pagedetail`.`score` AS `score` from ((`page` join `pagedetail`) join `subject`) where ((`page`.`SID` = `subject`.`ID`) and (`page`.`ID` = `pagedetail`.`PID`)) ;

-- --------------------------------------------------------

--
-- 视图结构 `recorder_view`
--
DROP TABLE IF EXISTS `recorder_view`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `recorder_view`  AS  select `arecorder`.`PID` AS `PID`,`page`.`name` AS `pname`,`arecorder`.`SID` AS `SID`,`subject`.`name` AS `sname`,`subject`.`picture` AS `picture`,`arecorder`.`Ascore` AS `Ascore`,`arecorder`.`time` AS `time`,`arecorder`.`Scontent` AS `Scontent` from ((`page` join `subject`) join `arecorder`) where ((`arecorder`.`PID` = `page`.`ID`) and (`page`.`SID` = `subject`.`ID`)) ;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
